Tekla.Structures.Model.BoltGroup.HoleType
The special hole type: oversized, slotted or no hole.

Tekla.Structures.Model.BoltGroup.SlottedHoleX
The X allowance of the slotted hole.

Tekla.Structures.Model.BoltGroup.SlottedHoleY
The Y allowance of the slotted hole.

Tekla.Structures.Model.BoltGroup.RotateSlots
The rotation of the slots: odd, even or parallel.